Teivaz/zeppelin/Modules/Beacon/Software/config/stm32l0xx_hal_conf.h
/**
	******************************************************************************
	* @file    stm32l0xx_hal_conf.h
	* @author  MCD Application Team, Teivaz
	* @brief   HAL configuration template file. 
	*          This file should be copied to the application folder and renamed
	*          to stm32l0xx_hal_conf.h.
	******************************************************************************
	* @attention
	*
	* <h2><center>&copy; Copyright (c) 2016 STMicroelectronics. 
	* All rights reserved.</center></h2>
	*
	* This software component is licensed by ST under BSD 3-Clause license,
	* the "License"; You may not use this file except in compliance with the 
	* License. You may obtain a copy of the License at:
	*                        opensource.org/licenses/BSD-3-Clause
	*
	******************************************************************************
	*/ 

#pragma once

#ifdef __cplusplus
 extern "C" {
#endif

/// @brief This is the list of modules to be used in the HAL driver 
#define HAL_MODULE_ENABLED  
//#define HAL_ADC_MODULE_ENABLED
//#define HAL_CRYP_MODULE_ENABLED
//#define HAL_COMP_MODULE_ENABLED
//#define HAL_CRC_MODULE_ENABLED
//#define HAL_CRYP_MODULE_ENABLED
//#define HAL_DAC_MODULE_ENABLED
//#define HAL_FIREWALL_MODULE_ENABLED
//#define HAL_I2S_MODULE_ENABLED
//#define HAL_IWDG_MODULE_ENABLED
//#define HAL_LCD_MODULE_ENABLED
//#define HAL_LPTIM_MODULE_ENABLED
//#define HAL_RNG_MODULE_ENABLED
#define HAL_RTC_MODULE_ENABLED
#define HAL_SPI_MODULE_ENABLED
//#define HAL_TIM_MODULE_ENABLED
//#define HAL_TSC_MODULE_ENABLED
//#define HAL_UART_MODULE_ENABLED
//#define HAL_USART_MODULE_ENABLED
//#define HAL_IRDA_MODULE_ENABLED
//#define HAL_SMARTCARD_MODULE_ENABLED
//#define HAL_SMBUS_MODULE_ENABLED
//#define HAL_WWDG_MODULE_ENABLED
//#define HAL_PCD_MODULE_ENABLED
//#define HAL_EXTI_MODULE_ENABLED
#define HAL_GPIO_MODULE_ENABLED
#define HAL_DMA_MODULE_ENABLED
#define HAL_I2C_MODULE_ENABLED
#define HAL_RCC_MODULE_ENABLED
#define HAL_FLASH_MODULE_ENABLED
#define HAL_PWR_MODULE_ENABLED
#define HAL_CORTEX_MODULE_ENABLED

/* ########################## Oscillator Values adaptation ####################*/
/**
	* @brief Adjust the value of External High Speed oscillator (HSE) used in your application.
	*        This value is used by the RCC HAL module to compute the system frequency
	*        (when HSE is used as system clock source, directly or through the PLL).  
	*/
#if !defined (HSE_VALUE) 
	#define HSE_VALUE ((uint32_t)8000000U) /*!< Value of the External oscillator in Hz */
#endif

#if !defined (HSE_STARTUP_TIMEOUT)
	#define HSE_STARTUP_TIMEOUT ((uint32_t)100U)   /*!< Time out for HSE start up, in ms */
#endif

/**
	* @brief Internal Multiple Speed oscillator (MSI) default value.
	*        This value is the default MSI range value after Reset.
	*/
#if !defined (MSI_VALUE)
	#define MSI_VALUE ((uint32_t)2097000U) /*!< Value of the Internal oscillator in Hz*/
#endif
	 
/**
	* @brief Internal High Speed oscillator (HSI) value.
	*        This value is used by the RCC HAL module to compute the system frequency
	*        (when HSI is used as system clock source, directly or through the PLL). 
	*/
#if !defined (HSI_VALUE)
	#define HSI_VALUE ((uint32_t)16000000U) /*!< Value of the Internal oscillator in Hz*/
#endif

/// @brief Internal High Speed oscillator for USB (HSI48) value.
#if !defined (HSI48_VALUE) 
#define HSI48_VALUE ((uint32_t)48000000U) /*!< Value of the Internal High Speed oscillator for USB in Hz.
																						 The real value may vary depending on the variations
																						 in voltage and temperature.  */
#endif

/// @brief Internal Low Speed oscillator (LSI) value.
#if !defined (LSI_VALUE) 
 #define LSI_VALUE ((uint32_t)37000U)       /*!< LSI Typical Value in Hz*/
#endif                                      /*!< Value of the Internal Low Speed oscillator in Hz
																						 The real value may vary depending on the variations
																						 in voltage and temperature.*/   
/**
	* @brief External Low Speed oscillator (LSE) value.
	*        This value is used by the UART, RTC HAL module to compute the system frequency
	*/
#if !defined (LSE_VALUE)
	#define LSE_VALUE ((uint32_t)32768U) /*!< Value of the External oscillator in Hz*/
#endif

#if !defined (LSE_STARTUP_TIMEOUT)
	#define LSE_STARTUP_TIMEOUT ((uint32_t)5000U)   /*!< Time out for LSE start up, in ms */
#endif

/* Tip: To avoid modifying this file each time you need to use different HSE,
	 ===  you can define the HSE value in your toolchain compiler preprocessor. */

/* ########################### System Configuration ######################### */
/// @brief This is the HAL system configuration section
#define VDD_VALUE            ((uint32_t)3300U) /*!< Value of VDD in mv */
#define TICK_INT_PRIORITY    ((uint32_t)0U)    /*!< tick interrupt priority */
#define USE_RTOS             0U     
#define PREFETCH_ENABLE      0U              
#define PREREAD_ENABLE       1U
#define BUFFER_CACHE_DISABLE 0U

/* ########################## Assert Selection ############################## */
/**
	* @brief Uncomment the line below to expanse the "assert_param" macro in the 
	*        HAL drivers code
	*/
/* #define USE_FULL_ASSERT    1U */

/// @brief Include module's header file 
#ifdef HAL_RCC_MODULE_ENABLED
#include "stm32l0xx_hal_rcc.h"
#endif

#ifdef HAL_EXTI_MODULE_ENABLED
#include "stm32l0xx_hal_exti.h"
#endif

#ifdef HAL_GPIO_MODULE_ENABLED
#include "stm32l0xx_hal_gpio.h"
#endif

#ifdef HAL_DMA_MODULE_ENABLED
#include "stm32l0xx_hal_dma.h"
#endif
	 
#ifdef HAL_CORTEX_MODULE_ENABLED
#include "stm32l0xx_hal_cortex.h"
#endif

#ifdef HAL_ADC_MODULE_ENABLED
#include "stm32l0xx_hal_adc.h"
#endif

#ifdef HAL_COMP_MODULE_ENABLED
#include "stm32l0xx_hal_comp.h"
#endif
	 
#ifdef HAL_CRC_MODULE_ENABLED
#include "stm32l0xx_hal_crc.h"
#endif

#ifdef HAL_CRYP_MODULE_ENABLED
#include "stm32l0xx_hal_cryp.h"
#endif

#ifdef HAL_DAC_MODULE_ENABLED
#include "stm32l0xx_hal_dac.h"
#endif

#ifdef HAL_FIREWALL_MODULE_ENABLED
#include "stm32l0xx_hal_firewall.h"
#endif

#ifdef HAL_FLASH_MODULE_ENABLED
#include "stm32l0xx_hal_flash.h"
#endif
 
#ifdef HAL_I2C_MODULE_ENABLED
#include "stm32l0xx_hal_i2c.h"
#endif

#ifdef HAL_I2S_MODULE_ENABLED
#include "stm32l0xx_hal_i2s.h"
#endif

#ifdef HAL_IWDG_MODULE_ENABLED
#include "stm32l0xx_hal_iwdg.h"
#endif

#ifdef HAL_LCD_MODULE_ENABLED
#include "stm32l0xx_hal_lcd.h"
#endif

#ifdef HAL_LPTIM_MODULE_ENABLED
#include "stm32l0xx_hal_lptim.h"
#endif
	 
#ifdef HAL_PWR_MODULE_ENABLED
#include "stm32l0xx_hal_pwr.h"
#endif

#ifdef HAL_RNG_MODULE_ENABLED
#include "stm32l0xx_hal_rng.h"
#endif

#ifdef HAL_RTC_MODULE_ENABLED
#include "stm32l0xx_hal_rtc.h"
#endif

#ifdef HAL_SPI_MODULE_ENABLED
#include "stm32l0xx_hal_spi.h"
#endif

#ifdef HAL_TIM_MODULE_ENABLED
#include "stm32l0xx_hal_tim.h"
#endif

#ifdef HAL_TSC_MODULE_ENABLED
#include "stm32l0xx_hal_tsc.h"
#endif

#ifdef HAL_UART_MODULE_ENABLED
#include "stm32l0xx_hal_uart.h"
#endif

#ifdef HAL_USART_MODULE_ENABLED
#include "stm32l0xx_hal_usart.h"
#endif

#ifdef HAL_IRDA_MODULE_ENABLED
#include "stm32l0xx_hal_irda.h"
#endif

#ifdef HAL_SMARTCARD_MODULE_ENABLED
#include "stm32l0xx_hal_smartcard.h"
#endif

#ifdef HAL_SMBUS_MODULE_ENABLED
#include "stm32l0xx_hal_smbus.h"
#endif

#ifdef HAL_WWDG_MODULE_ENABLED
#include "stm32l0xx_hal_wwdg.h"
#endif

#ifdef HAL_PCD_MODULE_ENABLED
#include "stm32l0xx_hal_pcd.h"
#endif

#ifdef USE_FULL_ASSERT
/**
	* @brief  The assert_param macro is used for function's parameters check.
	* @param  expr: If expr is false, it calls assert_failed function
	*         which reports the name of the source file and the source
	*         line number of the call that failed. 
	*         If expr is true, it returns no value.
	* @retval None
	*/
	#define assert_param(expr) ((expr) ? (void)0U : assert_failed((uint8_t *)__FILE__, __LINE__))
/* Exported functions ------------------------------------------------------- */
	void assert_failed(uint8_t* file, uint32_t line);
#else
#define assert_param(expr) ((void)0U)
#endif

#ifdef __cplusplus
}
#endif
